Autodesk.Revit.UI.RevitLinkUIUtils.ReportLinkLoadResults(Autodesk.Revit.DB.Document,System.Collections.Generic.IDictionary{System.String,Autodesk.Revit.DB.LinkLoadResult})
This function reports any errors which were encountered
when loading the Revit links represented by the given
LinkLoadResult map.
Remarks:
If all links succeeded in loading, the function does
nothing. If any links failed to load, this function
will display the Unresolved References dialog, giving
the user the option to open the Manage Links dialog
to correct any problems.
To ensure the dialog fits on the screen, Revit will
only list up to ten link names. Additional links will
be mentioned as, "And >number< additional links." This
is the same behavior Revit's user interface uses.
doc:
The document containing the links.
loadResults:
A map from the display name of a link to the LinkLoadResult
for that link.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015